<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"62182fd756108a0e196c8ad306d2daa848ed52a818a0aff493b3ba7f008d2cc5","plan_job_ref":"Job .github/workflows/_test-tf.yaml #145 at https://github.com/DND-IT/github-workflows/actions/runs/19444422904","plan_out_hash":"793dafc84b42e7ea8c168a54891a5b1910c6c332f101cf7337618b07aabc5dd1","plan_hash":"d43c23a48018ff05cba256bc27830a76df5e46498af85184cc92937eedd7c6d2","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #145](https://github.com/DND-IT/github-workflows/actions/runs/19444422904)